app/views/questions/show.html.erb

<label>Answers</label><br>
<%@question.answers.each do |answer|%>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 1]]