app/controllers/answers_controller.rb

    def index
        @answers=Answer.all
---
SELECT "answers".* FROM "answers"

    def show
        @answer=Answer.find(params[:id])
---
SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def new
        @questions=Question.all
        @answer=Answer.new
        @answers=Answer.all
---
SELECT "questions".* FROM "questions"
SELECT "answers".* FROM "answers"

    def create
        @answer=Answer.new(answer_params)
        @answer.save
---
INSERT INTO "answers" ("content", "solution", "question_id") VALUES (?, ?, ?)  [["content", "Gryffindor"], ["solution", 0], ["question_id", 3]]

    def edit
        @answer=Answer.find(params[:id])
---
SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 45], ["LIMIT", 1]]

    def update
        @answer=Answer.find(params[:id])
        @answer.update(answer_params)
---
SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 45], ["LIMIT", 1]]
UPDATE "answers" SET "content" = ?, "solution" = ? WHERE "answers"."id" = ?  [["content", "3223"], ["solution", 1], ["id", 45]]