app/controllers/games_controller.rb

    def create
         result =0
        params[:questions].each do |question_id,answer_id|
           @question = Question.find(question_id)
           @answer = Answer.find(answer_id)
           @solution =  @question.answers.find{|a| a.solution== true}
---
SELECT "questions".* FROM "questions"
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 7]]