app/controllers/games_controller.rb

    def result
        @game=Game.find(params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

    def correct_answers
        @result =0
        params[:questions].each do |question_id,answer_id|
           @question = Question.find(question_id)
           @answer = Answer.find(answer_id)
           @solution =  @question.answers.find{|a| a.solution== true}
           if @solution.id== @answer.id
            @result +=10
           end
        end
        @game=Game.create({user_id: session[:user_id], trivium_id: @question.trivium.id, result: @result  })
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 31]]
INSERT INTO "games" ("user_id", "trivium_id", "result") VALUES (?, ?, ?)  [["user_id", 3], ["trivium_id", 7], ["result", 20]]