app/controllers/questions_controller.rb

INSERT INTO "questions" ("content", "image", "trivium_id") VALUES (?, ?, ?)  [["content", "klfsfz"], ["image", ""], ["trivium_id", 1]]
---
  def create
    @question=Question.new(question_params)
    @question.save

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def show
    @question= Question.find(params[:id])

SELECT "questions".* FROM "questions"
---
  def index
    @questions= Question.all

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @question=Question.find(params[:id])

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "questions" SET "content" = ?, "image" = ? WHERE "questions"."id" = ?  [["content", "ow does Harry catch his first snitch?"], ["image", ""], ["id", 7]]
---
  def update
    @question=Question.find(params[:id])
    @question.update(question_params)