app/controllers/users_controller.rb

def handle_login
    user = User.find_by({ user_name: params[:user_name]})
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "datlogophile"], ["LIMIT", 1]]

   def index
    @users= User.all
---
SELECT "users".* FROM "users"

    def show
        @user= User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @user=User.new(user_params)
        @user.save
---
INSERT INTO "users" ("name", "email_address", "user_name", "password_digest") VALUES (?, ?, ?, ?)  [["name", "Melike"], ["email_address", "mzagic@gmail.com"], ["user_name", "melo"], ["password_digest", "$2a$12$Tc6nXb9mXfBqVcJoskROReRnC/Zi71mvXRl9k1F7cF4nFrFJnbREm"]]

    def edit
        @user =User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def update
        @user= User.find(params[:id])
        @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "user_name" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$wGQtSpJ1Uk5VZd0ZRBK7duwlYQ4YU/8HM5OrahIOe6e9Anredzz26"], ["user_name", "m123"], ["id", 2]]